{"blog": [{"title": "Hello!","timestamp": "November 11, 2019","thumb": "none","body": "It's up and running! This website is technically for a school project, and I'm <i>technically</i> supposed to be teaching you how to sew, and I guess I probably will, but I have like two days to finish it and get some feedback from some random strangers. <del>(despite what all the timestamps might say because they're lying)</del>"},{"title": "Sewing is Pointless","timestamp": "November 13, 2019","thumb": "none","body": "At some point a month ago or something, I tried to figure out who could actually use sewing, and it turns out there isn't really much of a market. Since clothes are so mass produceable, it's usually easier to just buy them instead. It's kind of a remnant of the yonder years, back before sewing machines. UNLESS, you're a teenager who does not have a job and thus have to rely on your parents to buy clothes for you, then you have a reason, because it's a lot easier to convince them to buy fabric than it is to convince them to buy some random shirt."},{"title": "Kinda Unrelated but...","timestamp": "November 13, 2019","thumb": "none","body": "Did you know there's a <a href='http://ismacs.net/' target='_blank'>society of sewing machine collectors</a> and that they are exactly as cool as they sound?"},{"title": "I Got a Sewing Machine!","timestamp": "November 14, 2019","thumb": "none","body": "<div style=\"text-align: center;\"><img src=\"./assets/sew-mach.png\" style=\"width: 70%; border-radius: 20px; padding: 0.75em;margin-bottom: 5em; border: .25em dashed var(--main)\"/></div><br/>I got a sewing machine! It's a bit late to actually use it for this project, but it's still nice to have one."},{"title": "Info Dump Incoming","timestamp": "November 15, 2019","thumb": "none","body": "Since I have to start working on the presentation like now, I'm going to try and tell you everything you need to know like right now. It's a running stitch. That's all you really need to do anything simple. You put a knot on one end of the thread, put it through a <i>hand-sewing</i> needle (because I genuinely don't really understand sewing machines yet) and then you put it through the fabric from the wrong side (which is just the side of the fabric that isn't going to be facing out or visible in the finished thing) and move some amount in a straight line on the right side and go back through the fabric. Repeat that with equal distances and you have yourself a running stitch. You can use it to hold together two pieces of fabric, and that's pretty much it unless you're into embroidery (which everyone should be because it's pretty cool)."},{"title": "Aside from Running Stitches...","timestamp": "November 15, 2019","thumb": "none","body": "While a running stitch is the only thing you really need, if you want to do anything cool things get complicated fast <a href='https://sewguide.com/invisible-stitches/' target='_blank'>(like this witchcraft)</a>. There are also a variety of needles you want to use depending on your fabric. They're all pretty much the same thing with slightly varying radii and sharpnesses. You can't really figure out which one you need without understanding fabrics (which I don't). For instance, if your working with a knit fabric, you want to use a needle with a rounder point so that you aren't going through the threads that make up the fabric, but around them. There are also other stitches, and you do actually need more than a running stitch to actually make anything, in my opinion the coolest ones are invisible stitches (read witchcraft). But the second most important after a running stitch would be a back stitch. It's used to lock a stitch and keep your stuff from falling apart. It's don by doing a running stitch and then at the end taking your stitch backwards through the last few pieces of your running stitch. A basting stitch is basically just a longer running stitch. Hem's have so far been my favorite part of things, and to do hems you want to use whip stitch. I don't really know why but at least it looks pretty. There are also some invisible stitches you could use like a slip stitch or couch stitch. Another important thing that's used to neaten up the edges of your fabric is an overcast stitch or double overcast. It just makes the edges cleaner and you should always do it. If you want a stretchy hem use a catch stitch which I also don't particularly understand how to actually do, but it can't be that difficult.<br />Honestly, if you're actually genuinely interested in sewing, my ramblings probably aren't going to give you all that much help, so I'll try to link some helpful resources instead (like <a href='https://sewguide.com/easy-hand-stitches/' target='_blank'>this one</a>)."},{"title": "Picking Fabrics","timestamp": "November 16,2019","thumb": "none","body": "I'll keep this one brief: pick fabrics that are good for what you're trying to do. Don't use a heavy fabric for something that needs to be flexible or drape well. Don't make dresses out of denim and don't make pants out of satin.<br/>Here's the actually helpful stuff (its mostly just explaining the different things that different fabrics and needles are good for and giving exmaples): <a href='https://www.mybluprint.com/article/perfect-picks-choosing-fabric-for-clothes' target='_blank'>fabrics</a>, <a href='https://sewing.com/choosing-sewing-needles/' target='_blank'>needles</a>"},{"title": "Reading Patterns","timestamp": "November 16, 2019","thumb": "none","body": "Patterns are usually pretty intuitive, but it's helpful to know where everything is and what all the symbols and lines actually <i>mean</i>. So here are some links.<br/>Any of these on their own should give you enough to get started with: <a href='https://www.dummies.com/crafts/sewing/reading-a-sewing-pattern/' target='_blank'>dummies</a>, <a href='https://www.thesewingdirectory.co.uk/understanding-sewing-patterns/' target='_blank'>an actual sewing magazine person</a>, <a href='https://sewingiscool.com/how-sewing-patterns-work/' target='_blank'>sewing is cool</a>"}],"patterns": [{"title": "Gloves #1","timestamp": "November 15, 2019","thumb": "none","body": "<a href=\"https://www.threadsmagazine.com/2009/08/25/patterns-for-gorgeous-gloves\">Source</a><br />A simple glove pattern I found."},{"title": "Gloves #2","timestamp": "November 15, 2019","thumb": "https://so-sew-easy.com/wp-content/uploads/2016/12/IMG_6927-768x512.jpg","body": "<a href=\"https://so-sew-easy.com/easy-gloves-pattern-winter-comfort/\">Source</a><br/>The pattern seems a bit more crude than the first one (as far as glove patterns go at least, they're already pretty simple), but the instructions are more thorough."}],"projects": [{"title": "Gloves","timestamp": "November 15, 2019","thumb": "none","body": "I'm thinking about trying to make gloves because it's around that season, the patterns look pretty simple, and I have some denim that I don't know what to do with."}]}