{
 "blog":[
    {
        "title":"Hello!",
        "body":"It's up and running! This website is technically for a project at school, although I plan to at least try to keep it going after the project ends. Hopefully, I will be able to get enough stuff on here soon enough for the project.<br /><del>Honestly, I'm literally just going to spam a link to this website everywhere and hope for the best.</del>",
        "thumb": "none",
        "timestamp": "November 11, 2019"
    },
    {
        "title": "Sewing is Pointless",
        "body": "My original purpose in the project that lead to this website was to figure out who might need sewing. It used to be a household skill and now it's widely fallen to the hobbyists, but there must've been a reason for that original widespread-ness.<br/>And of course, there was, but it seems like the hobbyists are the only audience left for it. Hand sewing has very little place now, for the obvious reason of the sewing machine. But beyond that, the sewing machine kind of made itself as a product unnecessary. Before the sewing machine, clothing was far from mass producible, it took more time and effort and care to hand sew something, but the sewing machine changed that. Once clothes could be mass produced, they became affordable, which made the ability to maintain the same clothing for a long period of time less important.<br/>However, that doesn't mean that sewing is completely obsolete. It's a good hobby, obviously, because you can throw a bunch of time into it and in the end you have a swankified new thing. But it's also useful if you don't have a whole lot of disposable income to throw into clothing, like if you are a teenager who doesn' have a job and has to rely on their parents for money.<br/><del>Sorry for the brick of text, I couldn't really split this post up very much.~~",
        "thumb": "none",
        "timestamp": "November 13, 2019"
    },
    {
        "title": "Completely Unrelated but...",
        "body": "Did you know there's a <a href=\"http://ismacs.net/\">society of sewing machine collectors</a>? And that they're exactly as cool as they sound?",
        
        "timestamp": "November 13, 2019"
    },
    {
        "title": "Got a Sewing Machine!",
        "body": "<img src=\"./assets/sew-mach.jpeg\" /><br/>I got a sewing machine! It's a bit late to actually use it for the assignment, but it's still nice to have one.<br/>I suppose now is as good a time as any to start getting into stuff. Basically, sewing is simple. With your trusty running stitch and the practice to keep your lines straight, you can do a lot. Despite that though, once you try to get into it in any real depth, it gets very complicated very quickly. I'll be trying to express what I've learned and understand of sewing on this website over the next week, and probably longer. I know some of these early posts are seeming very block-texty, but please stick around for the rest, I promise they'll be more readable.",
        "thumb": "none",
        "timestamp": "November 14, 2019"
    }
 ],
 "patterns": [
     {
        "title": "Pencil Pouch (Crazy Little Projects)",
        "body": "<a href=\"https://crazylittleprojects.com/pencil-case-tutorial/\">Source</a>",
        "thumb": "https://crazylittleprojects.com/wp-content/uploads/2014/08/Pencilcasepatternandtutorial.png",
        "timestamp": "November 11, 2019"
    }
 ]
}