{"posts":[{"title":"Welcome to Bristol","body":"<b>VOICE:</b> Because across all humanity, across every conceivable permutation, you are the one who makes it the furthest.<br>It speaks plainly, as if the statement were a foregone conclusion. Yet its words strike me into silence.<br>The creature continues.<br><b>VOICE:</b> I’ve watched you work your way here, through skill and through tenacity… and undeniably through luck. You were brought here because of these qualities, and they will carry you further along the road than any other.<br><b>AS:</b> Then why didn’t you just bring me here? All that influence and you didn’t lift a finger… after everything that happened-<br><b>VOICE:</b> Events transpired as they needed to.<br><b>AS:</b> As they… needed to?! People died! Marjorie. Bobby. Ace. Apollo. Eve. Lilith. Everyone. They’re all gone. Do you not care at all?<br>In response to my words, the entity remains silent for longer than usual.<br><b>VOICE:</b> I care more than you know. There are things greater than your understanding, forces that exist beyond the realms of your comprehension that you would consider a threat to everything you hold dear. My actions were guided by a higher standard of knowledge. Your protests are predicated on false understanding.<br><b>AS:</b> You’re saying I don’t understand death?<br><b>VOICE:</b> You don’t.<br><b>AS:</b> ... That still doesn’t make it right.<br><b>VOICE:</b> Regardless, my influence is necessary. That which is necessary must be.<br><b>AS:</b> What even are you?<br><b>VOICE:</b> I cannot answer that question in any way you’d understand.<br><b>AS:</b> That's not good enough.<br>The creature doesn’t respond, as if it doesn’t feel it needs to. So far it’s returned my every argument with impenetrable certainty. From the domain it occupies, knowing what it knows, my arguments must seem entirely facile. Even if it did feel the need to justify itself, after seeing the place it hails from, I wonder if there’s any way I could ever comprehend its motives.<br>Still, that doesn’t mean my arguments are invalid, and the creature’s lofty dispassion does little more than stoke my desire to oppose it.<br><b>AS:</b> And what if I don’t want any part of this?<br><b>VOICE:</b> You are traveling the aberrant strand; a singularly stable flaw in the fabric of reality. As it carries you further from the world you know, you will be freed from the influence of the old laws. You have already noticed the effects in those who settled the road, those who were lost to it and in yourself; energy without consumption, knowledge without requisite experience. You are shedding entropy, and causality and in time you will reach realms of understanding you cannot currently fathom. You will find answers to questions you never thought to ask. You will discover absolute truth. For this reason, you will carry on.<br><b>AS:</b> That’s the only reason?<br><b>VOICE:</b> Do you need another?"}]}