{"blog": [{"title": "Hello!","timestamp": "November 11, 2019","thumb": "none","body": "It's up and running! This website is technically for a school project, and I'm <i>technically</i> supposed to be teaching you how to sew, and I guess I probably will, but I have like two days to finish it and get some feedback from some random strangers. <del>(despite what all the timestamps might say because they're lying)</del>"},{"title": "Sewing is Pointless","timestamp": "November 13, 2019","thumb": "none","body": "At some point a month ago or something, I tried to figure out who could actually use sewing, and it turns out there isn't really much of a market. Since clothes are so mass produceable, it's usually easier to just buy them instead. It's kind of a remnant of the yonder years, back before sewing machines. UNLESS, you're a teenager who does not have a job and thus have to rely on your parents to buy clothes for you, then you have a reason, because it's a lot easier to convince them to buy fabric than it is to convince them to buy some random shirt."},{"title": "Kinda Unrelated but...","timestamp": "November 13, 2019","thumb": "none","body": "Did you know there's a <a href='http://ismacs.net/'>society of sewing machine collectors</a> and that they are exactly as cool as they sound."},{"title": "I Got a Sewing Machine!","timestamp": "November 14, 2019","thumb": "none","body": "<div style=\"text-align: center;\"><img src=\"./assets/sew-mach.png\" style=\"width: 70%; border-radius: 20px; padding: 0.75em;margin-bottom: 5em; border: .25em dashed var(--main)\"/></div><br/>I got a sewing machine! It's a bit late to actually use it for this project, but it's still nice to have one."}],"patterns": [{"title": "Gloves #1","timestamp": "November 15, 2019","thumb": "","body": "<a href=\"https://www.threadsmagazine.com/2009/08/25/patterns-for-gorgeous-gloves\">Source</a><br />A simple glove pattern I found."},{"title": "Gloves #2","timestamp": "November 15, 2019","thumb": "","body": "<a href=\"https://so-sew-easy.com/easy-gloves-pattern-winter-comfort/\">Source</a><br/>The pattern seems a bit more crude than the first one (as far as glove patterns go at least, they're already pretty simple), but the instructions are more thorough."}],"projects": [{"title": "Gloves","timestamp": "November 15, 2019","thumb": "none","body": "I'm thinking about trying to make gloves because it's around that season, the patterns look pretty simple, and I have some denim that I don't know what to do with."}]}